<script setup lang="ts">
  import tmApp from '@/tmui/components/tm-app/tm-app.vue';
  import tmSheet from '@/tmui/components/tm-sheet/tm-sheet.vue';
</script>

<template>
  <tm-app>
    <tm-sheet :margin="[0, 0]">
      <view class="uno-h-100vh">
        <p style="font-weight: bold">特别提示：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本协议约定本公司与用户之间的权利义务。“用户”是指下载、安装、注册、登录、使用（以下统称“使用”）本服务的个人。
          本公司在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。
          请您审慎阅读并充分理解本协议，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通和使用特殊单项服务的条款、法律适用和争议解决条款等。
          其中，免除或者限制责任条款等重要内容将以加粗形式提示用户注意，您应重点阅读。如您不同意本协议，这将导致本公司无法为您提供完整的产品和服务，您也可以选择停止使用。
          如您自主选择同意或使用本公司软件及相关服务，则视为您已充分理解本协议，并同意作为本协议的一方当事人接受本协议以及其他与本公司及相关服务相关的协议和规则的约束。
          为给用户提供更好的服务或因国家法律法规、政策调整、技术条件、产品功能等变化需要，本协议可由本公司适时修订更新，修订的内容构成本协议的组成部分。
          本协议更新后，本公司会通过官方网站公告或其他适当的方式提醒用户更新的内容，以便用户及时了解本协议的最新版本，用户也可以在网站首页或软件设置页面查阅最新版本的协议条款。如用户继续使用“本公司”软件及相关服务，即表示用户已同意接受修订后的本协议内容。
        </view>
        <!-- <p style="font-weight: bold; margin-top: 20rpx">一、帐号注册：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、用户在使用本服务前需要注册一个自己的帐号。该帐号应当使用手机号码绑定注册，
          请用户使用尚未与本公司帐号绑定的手机号码，以及未被本公司根据本协议封禁的手机号码注册“本公司”帐号。本公司可以根据用户需求或产品需要对帐号注册和绑定的方式进行变更。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、鉴于本公司帐号的绑定注册方式，用户同意本公司在注册时将使用用户提供的手机号码及/或自动提取用户的手机号码及自动提取用户的手机设备识别码等信息用于注册。
          用户同意给予运营商授权，授权运营商有权自动提取用户的手机号码进行认证并用于本公司账号注册，用户保证遵守运营商的相关服务条款，如运营商对用户的手机号认证成功，
          则用户的注册即完成。如用户不同意对运营商的授权和/或服务条款或者是用户的手机号认证失败，用户可以手动修改运营商提取的手机号码，采取验证码方式进行注册登录<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、用户理解并承诺，用户所设置的帐号不得违反国家法律法规及本公司的相关规则，用户的帐号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，
          未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等或采取其他足以让人引起混淆的方式）开设帐号，不得恶意注册本公司帐号（包括但不限于频繁注册、批量注册帐号等行为）。用户在帐号注册及使用过程中需遵守相关法律法规，
          不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。本公司有权对用户提交的注册信息进行审核。
        </view> -->
        <p style="font-weight: bold; margin-top: 20rpx">一、服务内容：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、本服务的具体内容由本公司根据实际情况提供，包括但不限于授权用户通过其帐号进行星座运势查询、天气查询。
          为更好的提升用户体验及服务，本公司将不定期变更其提供的服务（包括但不限于软件修改、升级、功能强化、开发新服务、软件替换等）；
          用户将会收到本公司关于服务变更的通知（包括但不限于系统提示、公告、站内信等）。用户有权选择接受更新后版本；如用户选择不作更新，
          则本服务的部分功能将受到限制或不能正常使用。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、本公司许可用户一项个人的、可撤销的、不可转让的、非独占地和非商业的合法使用本公司软件及相关服务的权利。本协议未明示授权的其他一切权利仍由本公司保留，
          用户在行使该些权利前须另行获得本公司的书面许可，同时本公司如未行使前述任何权利，并不构成对该权利的放弃。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、本公司提供的服务包含免费服务与收费服务。用户可以通过付费方式购买收费服务，具体方式为：
          用户通过网上银行、支付宝或其他“本公司”平台提供的付费途径支付。对于收费服务，本公司会在用户使用之前给予用户明确的提示，
          只有用户根据提示确认其同意按照前述支付方式支付费用并完成了支付行为，用户才能使用该等收费服务。
          支付行为的完成以银行或第三方支付平台生成“支付已完成”的确认通知为准。
        </view>
        <p style="font-weight: bold; margin-top: 20rpx">二、用户个人信息保护：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、用户在注册帐号或使用本服务的过程中，可能需要填写或提交一些必要的个人信息，如法律法规、规章规范性文件
          （以下称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中受到限制。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户个人信息包括：1）用户自行提供的用户个人信息（如注册时填写的手机号码等个人信息，
          用户开启定位功能并使用服务时的地理位置信息等）；2）其他方共享的用户个人信息；3）本公司为提供服务而合法收集的用户个人信息
          （如使用服务时系统自动采集的设备或软件信息，浏览历史信息，时间信息等信息，）。其中个人信息是指以电子或者其他方式记录的能够单独或者与
          其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。用户知悉、理解并同意，用户在使用本公司的产品与/或服务时，
          本公司将按照平台公布的《本公司隐私政策》的约定处理和保护用户的个人信息，因此希望用户能够仔细阅读、充分理解《本公司隐私政策》的全文，并在需要时，
          按照《本公司隐私政策》的指引，作出用户认为适当的选择。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、本公司重视对个人信息的保护，本公司将采取技术措施和其他必要措施，确保用户个人信息安全，
          防止在本服务中收集的用户个人信息泄露、毁损或丢失。在发生前述情形或者本公司发现存在发生前述情形的可能时，
          本公司将及时采取补救措施并告知用户，用户如发现存在前述情形亦需立即与本公司联系。
        </view>
        <p style="font-weight: bold; margin-top: 20rpx">三、内容规范：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于帐号头像、名称、用户说明等注册信息及认证资料
          ，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用帐号或本服务所产生的内容。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户不得利用“本公司”帐号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容： (1)
          反对宪法所确定的基本原则的； (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； (3) 损害国家荣誉和利益的； (4)
          歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的； (5)
          宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的； (6) 煽动民族仇恨、民族歧视，破坏民族团结的； (7) 破坏国家宗教政策，宣扬邪教和封建迷信的；
          (8) 散布谣言，扰乱经济秩序和社会秩序的； (9) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； (10)
          侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的； (11) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； (12) 以非法民间组织名义活动的； (13)
          不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的； (14)
          含有法律、行政法规、政策禁止的其他内容的信息。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、用户不得利用“本公司”帐号或本服务制作、上载、复制、发布、传播如下干扰“本公司”正常运营，以及侵犯其他用户或第三方合法权益，对网络生态造成不良影响的内容：
          (1) 使用夸张标题，内容与标题严重不符的； (2) 炒作绯闻、丑闻、劣迹等的； (3) 不当评述自然灾害、重大事故等灾难的； (4)
          带有性暗示、性挑逗等易使人产生性联想的； (5) 展现血腥、惊悚、残忍等致人身心不适的； (6) 煽动人群歧视、地域歧视等的； (7) 宣扬低俗、庸俗、媚俗内容的；
          (8) 可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的； (9) 含有辱骂、恐吓、威胁内容的； (10)
          含有骚扰、垃圾广告、恶意信息、诱骗信息的； (11) 侵害他人个人信息或资料的； (12) 侵害他人肖像权、知识产权、商业秘密等合法权利的； (13)
          含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容，对网络生态造成不良影响的信息。
        </view>
        <p style="font-weight: bold; margin-top: 20rpx">四、使用规则：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本公司的观点、
          立场或政策，本公司对此不承担任何责任。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户不得利用“本公司”帐号或本服务进行如下行为： (1)
          提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的； (2) 强制、诱导其他用户关注、点击链接页面或分享信息的； (3)
          虚构事实、隐瞒真相以误导、欺骗他人的； (4) 利用技术手段批量建立虚假帐号的； (5) 利用“本公司”帐号或本服务从事任何违法犯罪活动的； (6)
          制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的； (7)
          其他违反法律法规规定、侵犯其他用户合法权益、干扰“本公司”正常运营或本公司未明示授权的行为。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、用户须对利用“本公司”帐号或本服务传送信息的真实性、合法性、无害性、准确性、
          有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与本公司无关。如因此给本公司或第三方造成损害的，用户应当依法予以赔偿。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、本公司提供的服务中可能包括广告，用户同意在使用过程中显示本公司和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，
          用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，本公司不承担任何责任。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5、除非本公司书面许可，用户不得从事下列任一行为： (1) 删除软件及其副本上关于著作权的信息； (2)
          对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码； (3)
          对本公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等； (4)
          对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经本公司授权的第三方工具/服务接入软件和相关系统；
          (5)
          通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
          (6)
          通过非本公司开发、授权的第三方软件、插件、外挂、系统，登录或使用本公司软件及服务，或制作、发布、传播非本公司开发、授权的第三方软件、插件、外挂、系统。<br />
        </view>
        <p style="font-weight: bold; margin-top: 20rpx">五、设备权限调用：</p>
        <view style="font-size: 25rpx; width: 660rpx; margin: 10rpx 0 0 20rpx; line-height: 40rpx">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、为向您提供便捷、优质的服务，您知悉并同意我们调用您设备的一些权限，以下是我们可能调用的设备权限列表及对应的使用目的说明，
          您有权随时选择关闭下列权限的授权，但可能会影响您正常使用我们产品或服务的部分或全部功能。<br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、我们将遵循以下规则 (1)位置：
          您需要授权我们使用位置权限，以便于我们基于位置向您展示医院、医生等信息。如您拒绝授权，可能无法正常使用基于地理位置的信息展示与推送功能；
          (2)通讯录：在电话视频时为保护医患双方个人信息安全，我们提供免费中转电话、视频服务。您需要授权我们使用通讯录权限，
          以便于我们对此电话进行标识。您在使用相应功能时会看到弹窗提醒，询问您是否授权。如您拒绝授权，可能无法正常在电话视频咨询服务； (3)相机：
          您需要授权我们使用相机权限，以便于使用我们的核心业务功能，如在咨询中发送图片或视频通话。如您拒绝授权，可能无法正常在咨询中发送图片或进行视频通话；
          (4)通知：您需要授权我们使用通知权限，以便于使用各类消息提醒。如您拒绝授权，可能无法正常获取各类消息提醒；(5)：无线数据
          您需要授权我们使用无线数据权限，以便于我们的移动客户端可以连接网络，向您提供服务。如您拒绝授权，可能无法正常使用使用移动客户端；(6)：WLAN
          您需要授权我们使用 WLAN 权限，以便于我们的移动客户端可以连接网络，向您提供服务。如您拒绝授权，可能无法正常使用使用移动客户端；(7)：存储
          您需要授权我们使用存储权限，以便于我们的移动客户端可以写入存储用户信息和日志。您在使用相应服务需要使用存储功能时，会看到弹窗提醒，询问您是否授权。如您拒绝授权，可能无法正常使用使用移动客户端。
          8）麦克风（录音）
          您需要授权我们使用麦克风（录音）权限，以便于使用我们的核心业务功能，如在咨询中发送语音消息或视频通话。您在使用相应功能时会看到弹窗提醒，询问您是否授权。如您拒绝授权，可能无法正常在咨询中无法使用语音功能或进行视频通话。
          9）日历
          您需要授权我们使用日历权限，以便于使用我们的就诊提醒功能，如在挂号成功后，申请就诊日前的提醒服务。您在使用日历功能时会看到弹窗提醒，询问您是否授权。如您拒绝授权，可能无法正常将就诊提醒加入到您的日历中。<br />
          <p> &nbsp;</p>
        </view>
      </view>
    </tm-sheet>
  </tm-app>
</template>
<style></style>
